Revit 2026 API

# PresetInitialColor Class

---

This class encapsulates a preset initial lighting color.

SystemObject Autodesk.Revit.DB.LightingInitialColor Autodesk.Revit.DB.LightingPresetInitialColor

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PresetInitialColor : InitialColor
```
```vb
Public Class PresetInitialColor
	Inherits InitialColor
```
```cpp
public ref class PresetInitialColor : public InitialColor
```
```fsharp
type PresetInitialColor =
    class
        inherit InitialColor
    end
```

The PresetInitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PresetInitialColor(ColorPreset) | Creates an initial color preset object with the given preset value. |
|  | PresetInitialColor(PresetInitialColor) | Creates a copy of the given preset initial color |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from InitialColor) |
|  | Preset | The preset value |
|  | TemperatureValue | The light color temperature value in Kelvins. (Inherited from InitialColor) |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialColor derived object. (Inherited from InitialColor) |
|  | Dispose | (Inherited from InitialColor) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Lighting Namespace